{"description":{"type":"string","value":"<p><br></p><p><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Every cancer patient wants to know that their diagnosis, and the corresponding treatment, is determined with the utmost precision, and preferably with the most advanced technology.&nbsp;At Nucleai, we bring cancer patients cutting edge AI-based technology, by improving biopsy interpretation with machine learning and by creating novel precision medicine technology. Come join our team of experienced AI engineers and world-renowned clinicians, and help us make a difference.</span></p><p>&nbsp;</p><p><br></p><p><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">RESPONSIBILITY</span></p><p><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">&nbsp;</span></p><ul><li><span style=\"background-color: transparent;\">Lead complex projects involving biology, machine learning, and clinical outcomes. Oversee day-to-day technical developments.</span></li><li><span style=\"background-color: transparent;\">Take end to end responsibility for projects success. Manage relationships with clients - from project definition to project delivery.</span></li><li><span style=\"background-color: transparent;\">Drive prioritization of the product roadmap and closely accompany the platform development process.</span></li><li><span style=\"background-color: transparent;\">Interact with our R&amp;D teams, pharma clients and renowned clinicians to create novel game-changing clinical decision support solutions.&nbsp;</span></li></ul><p><br></p><p><br></p><p><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">REQUIREMENTS</span></p><p><br></p><ul><li><span style=\"background-color: transparent;\">Experience - At least 5 years of experience in product or scientific project management - must</span></li><li><span style=\"background-color: transparent;\">Attitude - “Gets the job done” attitude. Proven record of success leading complex projects - must</span></li><li><span style=\"background-color: transparent;\">Communication - excellent English and communication skills, capable of representing the company abroad - must&nbsp;</span></li><li><span style=\"background-color: transparent;\">Experience working in startup companies - must</span></li><li><span style=\"background-color: transparent;\">Background - a solid understanding of at least one of the following fields: oncology, immunology, bioinformatics - an advantage.&nbsp;</span></li></ul>"},"published":{"type":"string","value":"Hide"},"title":{"type":"string","value":"Senior Product Manager"}}